{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "85e7aafb",
   "metadata": {},
   "source": [
    "4. У вас есть данные о ценах акций за n дней в виде массива prices. Вы можете совершить не более k сделок (покупка + продажа = 1 сделка).\n",
    "Найдите максимальную прибыль, которую можно получить, соблюдая правила:\n",
    "\n",
    "–\tНельзя совершать несколько сделок одновременно (нельзя купить и продать в один и тот же день)\n",
    "\n",
    "–\tНельзя покупать, если уже есть купленные акции\n",
    "\n",
    "–\tМожно совершать любое количество сделок, но не более k\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9520562c",
   "metadata": {},
   "source": [
    "====================================================="
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "24931000",
   "metadata": {},
   "outputs": [],
   "source": [
    "def max_profit_k(k: int, prices: list[int], debug=False) -> int:\n",
    "\n",
    "    n = len(prices)\n",
    "    \n",
    "    # tсли нет данных или дней меньше 2, прибыль 0\n",
    "    if n <= 1 or k == 0:\n",
    "        return 0\n",
    "\n",
    "    # Если k >= n/2, собираем всю прибыль на каждом подъеме графика.\n",
    "    if k >= n // 2:\n",
    "        max_profit = 0\n",
    "        for i in range(1, n):\n",
    "            # Если цена выросла по сравнению со вчерашним днем — \"торгуем\"\n",
    "            if prices[i] > prices[i-1]:\n",
    "                max_profit += prices[i] - prices[i-1]\n",
    "        return max_profit\n",
    "\n",
    "    else:\n",
    "    \n",
    "        # buy[i] - максимальный баланс после ПОКУПКИ i-й акции.\n",
    "        # sell[i] - максимальный баланс после ПРОДАЖИ i-й акции.\n",
    "        # Изначально buy заполняем -inf (так как покупка — это трата денег),\n",
    "        # а sell заполняем 0 (прибыли пока нет).\n",
    "        \n",
    "        # Массивы размера k+1, чтобы удобно обращаться по индексу 1..k\n",
    "        buy = [-float('inf')] * (k + 1)\n",
    "        sell = [0] * (k + 1)\n",
    "\n",
    "        for price in prices:\n",
    "            for i in range(1, k + 1):\n",
    "                buy[i] = max(buy[i], sell[i-1] - price)\n",
    "                sell[i] = max(sell[i], buy[i] + price)\n",
    "\n",
    "            if debug:\n",
    "                print(\"price=\", price,\": buy=\", buy[1:], \", sell=\", sell[:], sep=\"\")\n",
    "                print()\n",
    "                \n",
    "        return sell[k]\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "7c859a67",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "price=3: buy=[-3, -3], sell=[0, 0, 0]\n",
      "\n",
      "price=2: buy=[-2, -2], sell=[0, 0, 0]\n",
      "\n",
      "price=6: buy=[-2, -2], sell=[0, 4, 4]\n",
      "\n",
      "price=5: buy=[-2, -1], sell=[0, 4, 4]\n",
      "\n",
      "price=1: buy=[-1, 3], sell=[0, 4, 4]\n",
      "\n",
      "price=3: buy=[-1, 3], sell=[0, 4, 6]\n",
      "\n",
      "Цены: [3, 2, 6, 5, 1, 3], k=2\n",
      "Максимальная прибыль: 6\n"
     ]
    }
   ],
   "source": [
    "prices = [3, 2, 6, 5, 1, 3]\n",
    "k = 2\n",
    "result = max_profit_k(k, prices, debug=True)\n",
    "\n",
    "print(f\"Цены: {prices}, k={k}\")\n",
    "print(f\"Максимальная прибыль: {result}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "819cd260",
   "metadata": {},
   "source": [
    "Теоретическая оценка алгоритма:\n",
    "\n",
    "* Время (Time Complexity): $O(n \\cdot k)$\n",
    "  * Цикл по ценам ($n$), в нем цикл по сделакам ($k$), и там арифметика $O(1)$\n",
    "  * При $k \\geq n/2$ временная сложность $O(n)$ (цикл по сделкам опускается)\n",
    "\n",
    "* Память (Space Complexity): $O(k)$\n",
    "  * Используем 2 массива длиной $k + 1$ каждый  $= O(k)$.\n",
    "  * При $k\\geq n/2$ пространственная сложность $O(1)$"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
